src/BusinessProcesses/ПодготовкаТестовойБазы/ПодготовкаТестовойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ПодготовкаТестовойБазы</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>КонвейерОбработки</name>
    <type>
      <types>BusinessProcessRef.ПодготовкаСредыДляИнтеграционныхТестов</types>
      <types>BusinessProcessRef.КонвейерОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>Коммит</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединенияИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединенияПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаСозданияКлона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючФоновогоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеВремяПерезапускаПроцесса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сообщения</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Шаг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

src/BusinessProcesses/ПодготовкаТестовойБазы/Forms/ФормаБизнесПроцесса/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	СхемаБП = ТекущийОбъект.ПолучитьКартуМаршрута();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РазблокироватьДанныеФормыДляРедактирования();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Параметр = Объект.Ссылка Тогда
		Прочитать();
		ОбновитьСхемуНаСервере();
		Оповестить("ЗаписьЗадачи", Объект.КонвейерОбработки, Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаБПВыбор(Элемент)
	Задача = ПолучитьСсылкуНаЗадачу(Элемент.ТекущийЭлемент.Значение);
	Если ЗначениеЗаполнено(Задача) Тогда
		ПоказатьЗначение(, Задача);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьШаг(Команда)
	Если Модифицированность Тогда
		Сообщить("Надо записать");
		Возврат;
	КонецЕсли;
	Прочитать();
	ВыполнитьШагНаСервере();
	Прочитать();
	ОбновитьСхему(Команда);
	Оповестить("ЗаписьЗадачи", Объект.КонвейерОбработки, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСхему(Команда)
	Прочитать();
	ОбновитьСхемуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Конфигуратор(Команда)
	РаботаСФормамиКлиент.Запуск1СПредприятия(Объект.СтрокаСоединенияПриемник+"DESIGNER");
КонецПроцедуры

&НаКлиенте
Процедура ОбычноеПриложение(Команда)
	РаботаСФормамиКлиент.Запуск1СПредприятия(Объект.СтрокаСоединенияПриемник+"RunModeOrdinaryApplication");
КонецПроцедуры

&НаКлиенте
Процедура УправляемоеПриложение(Команда)
	РаботаСФормамиКлиент.Запуск1СПредприятия(Объект.СтрокаСоединенияПриемник+"RunModeManagedApplication");
КонецПроцедуры

&НаКлиенте
Процедура ЗапуситьПроцессКлонирования(Команда)
	ЗапуситьПроцессКлонированияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьШагНаСервере()
	КонвейерОбработкиСервер.ВыполнитьШагБизнесПроцесса(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьСхемуНаСервере()
	СхемаБП = РеквизитФормыВЗначение("Объект").ПолучитьКартуМаршрута();
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаЗадачу(ТочкаМаршрута)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс = &БизнесПроцесс
		|	И ЗадачаИсполнителя.ТочкаМаршрута = &ТочкаМаршрута";
	Запрос.УстановитьПараметр("БизнесПроцесс", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Если ТочкаМаршрута.Вид = ВидТочкиМаршрутаБизнесПроцесса.Действие Тогда
		Задача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		Задача.БизнесПроцесс = Объект.Ссылка;
		Задача.ТочкаМаршрута = ТочкаМаршрута;
		Задача.Наименование = Задача.ТочкаМаршрута;
		Задача.Дата = ТекущаяДатаСеанса();
		Задача.РольИсполнителя = ТочкаМаршрута.РольИсполнителя;
		Задача.Записать();
		Возврат Задача.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ЗапуситьПроцессКлонированияНаСервере()
	БизнесПроцессы.ПодготовкаТестовойБазы.ЗапуститьСозданиеКлона(Объект.Ссылка, Истина);
КонецПроцедуры

#КонецОбласти
